zephyrproject-rtos/zephyr/drivers/rtc/rtc_stm32.c
/*
 * Copyright (c) 2023 Prevas A/S
 * Copyright (c) 2023 Syslinbit
 * Copyright (c) 2024 STMicroelectronics
 * Copyright (c) 2025 Alexander Kozhinov <ak.alexander.kozhinov@gmail.com>
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 */

#define DT_DRV_COMPAT st_stm32_rtc

#include <errno.h>
#include <zephyr/device.h>
#include <zephyr/kernel.h>
#include <zephyr/init.h>
#include <zephyr/devicetree.h>
#include <zephyr/spinlock.h>
#include <zephyr/drivers/rtc.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/sys/util.h>
#include <soc.h>
#include <stm32_bitops.h>
#include <stm32_ll_cortex.h>
#include <stm32_ll_pwr.h>
#include <stm32_ll_rcc.h>
#include <stm32_ll_rtc.h>
#ifdef CONFIG_RTC_ALARM
#include <zephyr/drivers/interrupt_controller/intc_exti_stm32.h>
#endif /* CONFIG_RTC_ALARM */

#include <zephyr/logging/log.h>
#ifdef CONFIG_RTC_ALARM
#include <zephyr/irq.h>
#endif /* CONFIG_RTC_ALARM */

#include <stm32_backup_domain.h>
#include <stm32_hsem.h>

#include <stdbool.h>
#include "rtc_utils.h"

#include "rtc_stm32.h"

LOG_MODULE_REGISTER(rtc_stm32, CONFIG_RTC_LOG_LEVEL);

#if (defined(CONFIG_SOC_SERIES_STM32L1X) && !defined(RTC_SUBSECOND_SUPPORT)) \
	|| defined(CONFIG_SOC_SERIES_STM32F2X)
/* subsecond counting is not supported by some STM32L1x MCUs (Cat.1) & by STM32F2x SoC series */
#define HW_SUBSECOND_SUPPORT 0
#else
#define HW_SUBSECOND_SUPPORT 1
#endif

#ifdef CONFIG_STM32_HAL2
#define STM32_RTC_LL_HOURFORMAT_24H		LL_RTC_HOUR_FORMAT_24HOUR
#define STM32_RTC_LL_HOURFORMAT_AMPM		LL_RTC_HOUR_FORMAT_AMPM
#define STM32_RTC_LL_RTC_TIME_FORMAT_AM_OR_24	LL_RTC_TIME_FORMAT_AM_24H
#define STM32_RTC_LL_GET_WEEKDAY		LL_RTC_GET_WEEKDAY
#define STM32_RTC_LL_GET_MINUTE			LL_RTC_GET_MINUTE
#define STM32_RTC_LL_GET_SECOND			LL_RTC_GET_SECOND
#define STM32_RTC_LL_GET_MONTH			LL_RTC_GET_MONTH
#define STM32_RTC_LL_GET_YEAR			LL_RTC_GET_YEAR
#define STM32_RTC_LL_GET_HOUR			LL_RTC_GET_HOUR
#define STM32_RTC_LL_GET_DAY			LL_RTC_GET_DAY
#define STM32_RTC_EnableBypassShadowReg		LL_RTC_EnableBypassShadowReg
#define STM32_RTC_DisableBypassShadowReg	LL_RTC_DisableBypassShadowReg

/* On HAL2 this macro skips the RTC instance as the first argument,
 * only the potential following arguments are passed.
 */
#define STM32_ARG(dev, ...)	__VA_ARGS__
#else /* CONFIG_STM32_HAL2 */
#define STM32_RTC_LL_HOURFORMAT_24H		LL_RTC_HOURFORMAT_24HOUR
#define STM32_RTC_LL_HOURFORMAT_AMPM		LL_RTC_HOURFORMAT_AMPM
#define STM32_RTC_LL_RTC_TIME_FORMAT_AM_OR_24	LL_RTC_TIME_FORMAT_AM_OR_24
#define STM32_RTC_LL_GET_WEEKDAY		__LL_RTC_GET_WEEKDAY
#define STM32_RTC_LL_GET_MINUTE			__LL_RTC_GET_MINUTE
#define STM32_RTC_LL_GET_SECOND			__LL_RTC_GET_SECOND
#define STM32_RTC_LL_GET_MONTH			__LL_RTC_GET_MONTH
#define STM32_RTC_LL_GET_YEAR			__LL_RTC_GET_YEAR
#define STM32_RTC_LL_GET_HOUR			__LL_RTC_GET_HOUR
#define STM32_RTC_LL_GET_DAY			__LL_RTC_GET_DAY
#define STM32_RTC_EnableBypassShadowReg		LL_RTC_EnableShadowRegBypass
#define STM32_RTC_DisableBypassShadowReg	LL_RTC_DisableShadowRegBypass

/* On HAL1 this macro adds the RTC instance as the first argument,
 * with or without a comma depending on number of arguments.
 */
#define STM32_ARG(dev, ...)	COND_CODE_1(IS_EMPTY(__VA_ARGS__), (dev), (dev, __VA_ARGS__))
#endif /* CONFIG_STM32_HAL2 */

/* RTC start time: 1st, Jan, 2000 */
#define RTC_YEAR_REF 2000
/* struct tm start time:   1st, Jan, 1900 */
#define TM_YEAR_REF 1900

/* Convert part per billion calibration value to a number of clock pulses added or removed each
 * 2^20 clock cycles so it is suitable for the CALR register fields
 *
 * nb_pulses = ppb * 2^20 / 10^9 = ppb * 2^11 / 5^9 = ppb * 2048 / 1953125
 */
#define PPB_TO_NB_PULSES(ppb) DIV_ROUND_CLOSEST((ppb) * 2048, 1953125)

/* Convert CALR register value (number of clock pulses added or removed each 2^20 clock cycles)
 * to part ber billion calibration value
 *
 * ppb = nb_pulses * 10^9 / 2^20 = nb_pulses * 5^9 / 2^11 = nb_pulses * 1953125 / 2048
 */
#define NB_PULSES_TO_PPB(pulses) DIV_ROUND_CLOSEST((pulses) * 1953125, 2048)

/* CALP field can only be 512 or 0 as in reality CALP is a single bit field representing 512 pulses
 * added every 2^20 clock cycles
 */
#define MAX_CALP (512)
#define MAX_CALM (511)

#define MAX_PPB NB_PULSES_TO_PPB(MAX_CALP)
#define MIN_PPB -NB_PULSES_TO_PPB(MAX_CALM)

/* Timeout in microseconds used to wait for flags */
#define RTC_TIMEOUT 1000

#ifdef STM32_RTC_ALARM_ENABLED
#define RTC_STM32_ALARMS_COUNT	DT_INST_PROP(0, alarms_count)

#define RTC_STM32_ALRM_A	0U
#define RTC_STM32_ALRM_B	1U

/* Zephyr mask supported by RTC device, values from RTC_ALARM_TIME_MASK */
#define RTC_STM32_SUPPORTED_ALARM_FIELDS				\
	(RTC_ALARM_TIME_MASK_SECOND | RTC_ALARM_TIME_MASK_MINUTE	\
	| RTC_ALARM_TIME_MASK_HOUR | RTC_ALARM_TIME_MASK_WEEKDAY	\
	| RTC_ALARM_TIME_MASK_MONTHDAY)

#define RTC_STM32_EXTI_LINE_NUM	DT_INST_PROP_OR(0, alrm_exti_line, 0)

#endif /* STM32_RTC_ALARM_ENABLED */

struct rtc_stm32_config {
	uint32_t async_prescaler;
	uint32_t sync_prescaler;
	const struct stm32_pclken *pclken;
#if DT_INST_NODE_HAS_PROP(0, calib_out_freq)
	uint32_t cal_out_freq;
#endif
#if DT_INST_CLOCKS_CELL_BY_IDX(0, 1, bus) == STM32_SRC_HSE
	uint32_t hse_prescaler;
#endif
};

#ifdef STM32_RTC_ALARM_ENABLED
struct rtc_stm32_alrm {
	rtc_alarm_callback user_callback;
	void *user_data;
	bool is_pending;
};
#endif /* STM32_RTC_ALARM_ENABLED */

struct rtc_stm32_data {
	struct k_spinlock lock;
#ifdef STM32_RTC_ALARM_ENABLED
	struct rtc_stm32_alrm rtc_alrm_a;
	struct rtc_stm32_alrm rtc_alrm_b;
#endif /* STM32_RTC_ALARM_ENABLED */
};

#ifdef STM32_RTC_ALARM_ENABLED

static inline void exti_enable_rtc_alarm_it(uint32_t line_num)
{
#if defined(CONFIG_SOC_SERIES_STM32U3X) || defined(CONFIG_SOC_SERIES_STM32U5X) || \
	defined(CONFIG_SOC_SERIES_STM32WBAX)
	/* in STM32U3, STM32U5 & STM32WBAX series, RTC Alarm event is not routed to EXTI */
#else
	int ret;

	ret = stm32_exti_enable(line_num, STM32_EXTI_TRIG_RISING, STM32_EXTI_MODE_IT);
	if (ret != 0) {
		LOG_ERR("Failed to enable EXTI line number %d (error %d)", line_num, ret);
	}
#endif
}

static inline void exti_clear_rtc_alarm_flag(uint32_t line_num)
{
#if defined(CONFIG_SOC_SERIES_STM32U3X) || defined(CONFIG_SOC_SERIES_STM32U5X) || \
	defined(CONFIG_SOC_SERIES_STM32WBAX)
	/* in STM32U3, STM32U5 & STM32WBAX series, RTC Alarm (EXTI event) is not routed to EXTI */
#else
	if (stm32_exti_is_pending(line_num)) {
		stm32_exti_clear_pending(line_num);
	}
#endif
}

#endif /* STM32_RTC_ALARM_ENABLED */

static int rtc_stm32_enter_init_mode(void)
{
	int status = 0;

	/* Check if the Initialization mode is set */
	if (LL_RTC_IsActiveFlag_INIT(STM32_ARG(RTC)) == 0U) {
		/* Set the Initialization mode */
		LL_RTC_EnableInitMode(STM32_ARG(RTC));
		if (!WAIT_FOR(LL_RTC_IsActiveFlag_INIT(STM32_ARG(RTC)), RTC_TIMEOUT, NULL)) {
			status = -ETIMEDOUT;
		}
	}
	return status;
}

static int rtc_stm32_configure(const struct device *dev)
{
	const struct rtc_stm32_config *cfg = dev->config;

	int err = 0;

	uint32_t hour_format     = LL_RTC_GetHourFormat(STM32_ARG(RTC));
	uint32_t sync_prescaler  = LL_RTC_GetSynchPrescaler(STM32_ARG(RTC));
	uint32_t async_prescaler = LL_RTC_GetAsynchPrescaler(STM32_ARG(RTC));

	LL_RTC_DisableWriteProtection(STM32_ARG(RTC));

	/* configuration process requires to stop the RTC counter so do it
	 * only if needed to avoid inducing time drift at each reset
	 */
	if ((hour_format != STM32_RTC_LL_HOURFORMAT_24H) ||
	    (sync_prescaler != cfg->sync_prescaler) ||
	    (async_prescaler != cfg->async_prescaler)) {
		err = rtc_stm32_enter_init_mode();

