zephyrproject-rtos/zephyr/drivers/rtc/rtc_stm32.c
		if (err == 0) {
			LL_RTC_SetHourFormat(STM32_ARG(RTC, STM32_RTC_LL_HOURFORMAT_24H));
			LL_RTC_SetSynchPrescaler(STM32_ARG(RTC, cfg->sync_prescaler));
			LL_RTC_SetAsynchPrescaler(STM32_ARG(RTC, cfg->async_prescaler));
		}

		LL_RTC_DisableInitMode(STM32_ARG(RTC));
	}

#if DT_INST_NODE_HAS_PROP(0, calib_out_freq)
	LL_RTC_CAL_SetOutputFreq(STM32_ARG(RTC, cfg->cal_out_freq));
#else
	LL_RTC_CAL_SetOutputFreq(STM32_ARG(RTC, LL_RTC_CALIB_OUTPUT_NONE));
#endif

#ifdef RTC_CR_BYPSHAD
	STM32_RTC_EnableBypassShadowReg(STM32_ARG(RTC));
#endif /* RTC_CR_BYPSHAD */

	LL_RTC_EnableWriteProtection(STM32_ARG(RTC));

	return err;
}

#ifdef STM32_RTC_ALARM_ENABLED
static void rtc_stm32_init_alarm(const struct rtc_time *timeptr, uint16_t id, uint16_t mask)
{
	uint32_t seconds = 0;
	uint32_t minutes = 0;
	uint32_t hours = 0;
	uint32_t day_weekday = LL_RTC_WEEKDAY_SUNDAY;
	uint32_t day_weekday_sel = RTC_STM32_ALRM_DATEWEEKDAYSEL_DATE;
	uint32_t ll_mask = RTC_STM32_ALRM_MASK_ALL;

	/*
	 * STM32 RTC Alarm LL mask should be set for all fields beyond the broadest one
	 * that's being matched with RTC calendar to trigger alarm periodically,
	 * the opposite of Zephyr RTC Alarm mask which is set for active fields.
	 */
	if (mask & RTC_ALARM_TIME_MASK_SECOND) {
		ll_mask &= ~RTC_STM32_ALRM_MASK_SECONDS;
		seconds = bin2bcd(timeptr->tm_sec);
	}

	if (mask & RTC_ALARM_TIME_MASK_MINUTE) {
		ll_mask &= ~RTC_STM32_ALRM_MASK_MINUTES;
		minutes = bin2bcd(timeptr->tm_min);
	}

	if (mask & RTC_ALARM_TIME_MASK_HOUR) {
		ll_mask &= ~RTC_STM32_ALRM_MASK_HOURS;
		hours = bin2bcd(timeptr->tm_hour);
	}

	if (mask & RTC_ALARM_TIME_MASK_WEEKDAY) {
		/* the Alarm Mask field compares with the day of the week */
		ll_mask &= ~RTC_STM32_ALRM_MASK_DATEWEEKDAY;
		day_weekday_sel = RTC_STM32_ALRM_DATEWEEKDAYSEL_WEEKDAY;

		if (timeptr->tm_wday == 0) {
			/* sunday (tm_wday = 0) is not represented by the same value in hardware */
			day_weekday = LL_RTC_WEEKDAY_SUNDAY;
		} else {
			/* all the other values are consistent with what is expected by hardware */
			day_weekday = bin2bcd(timeptr->tm_wday);
		}

	} else if (mask & RTC_ALARM_TIME_MASK_MONTHDAY) {
		/* the Alarm compares with the day number & ignores the day of the week */
		ll_mask &= ~RTC_STM32_ALRM_MASK_DATEWEEKDAY;
		day_weekday_sel = RTC_STM32_ALRM_DATEWEEKDAYSEL_DATE;
		day_weekday = bin2bcd(timeptr->tm_mday);
	}

	/* Disable the write protection for RTC registers */
	LL_RTC_DisableWriteProtection(STM32_ARG(RTC));

	if (id == RTC_STM32_ALRM_A) {
		if (day_weekday_sel == RTC_STM32_ALRM_DATEWEEKDAYSEL_DATE) {
			/* Set the date for ALARM */
			LL_RTC_ALMA_DisableWeekday(STM32_ARG(RTC));
			LL_RTC_ALMA_SetDay(STM32_ARG(RTC, day_weekday));
		} else {
			/* Set the week day for ALARM */
			LL_RTC_ALMA_EnableWeekday(STM32_ARG(RTC));
			LL_RTC_ALMA_SetWeekDay(STM32_ARG(RTC, day_weekday));
		}

		/* Configure the Alarm register */
		LL_RTC_ALMA_ConfigTime(STM32_ARG(RTC, STM32_RTC_LL_RTC_TIME_FORMAT_AM_OR_24,
						 hours, minutes, seconds));

		/* Set ALARM mask */
		LL_RTC_ALMA_SetMask(STM32_ARG(RTC, ll_mask));
#if HW_SUBSECOND_SUPPORT
		LL_RTC_ALMA_SetSubSecondMask(STM32_ARG(RTC, 0));
#endif
	}
#if RTC_STM32_ALARMS_COUNT > 1
	if (id == RTC_STM32_ALRM_B) {
		if (day_weekday_sel == RTC_STM32_ALRM_DATEWEEKDAYSEL_DATE) {
			/* Set the date for ALARM */
			LL_RTC_ALMB_DisableWeekday(STM32_ARG(RTC));
			LL_RTC_ALMB_SetDay(STM32_ARG(RTC, day_weekday));
		} else {
			/* Set the week day for ALARM */
			LL_RTC_ALMB_EnableWeekday(STM32_ARG(RTC));
			LL_RTC_ALMB_SetWeekDay(STM32_ARG(RTC, day_weekday));
		}

		/* Configure the Alarm register */
		LL_RTC_ALMB_ConfigTime(STM32_ARG(RTC, STM32_RTC_LL_RTC_TIME_FORMAT_AM_OR_24,
						 hours, minutes, seconds));

		/* Set ALARM mask */
		LL_RTC_ALMB_SetMask(STM32_ARG(RTC, ll_mask));
#if HW_SUBSECOND_SUPPORT
		LL_RTC_ALMB_SetSubSecondMask(STM32_ARG(RTC, 0));
#endif
	}
#endif /* RTC_STM32_ALARMS_COUNT > 1 */

	/* Enable the write protection for RTC registers */
	LL_RTC_EnableWriteProtection(STM32_ARG(RTC));
}

static inline void rtc_stm32_clear_alarm_flag(uint16_t id)
{
	if (id == RTC_STM32_ALRM_A) {
		LL_RTC_ClearFlag_ALRA(STM32_ARG(RTC));
		return;
	}
#if RTC_STM32_ALARMS_COUNT > 1
	if (id == RTC_STM32_ALRM_B) {
		LL_RTC_ClearFlag_ALRB(STM32_ARG(RTC));
	}
#endif /* RTC_STM32_ALARMS_COUNT > 1 */
}

static inline uint32_t rtc_stm32_is_active_alarm(uint16_t id)
{
	if (id == RTC_STM32_ALRM_A) {
		return LL_RTC_IsActiveFlag_ALRA(STM32_ARG(RTC));
	}
#if RTC_STM32_ALARMS_COUNT > 1
	if (id == RTC_STM32_ALRM_B) {
		return LL_RTC_IsActiveFlag_ALRB(STM32_ARG(RTC));
	}
#endif /* RTC_STM32_ALARMS_COUNT > 1 */

	return 0;
}

static inline void rtc_stm32_enable_interrupt_alarm(uint16_t id)
{
	if (id == RTC_STM32_ALRM_A) {
		LL_RTC_EnableIT_ALRA(STM32_ARG(RTC));
		return;
	}
#if RTC_STM32_ALARMS_COUNT > 1
	if (id == RTC_STM32_ALRM_B) {
		LL_RTC_EnableIT_ALRB(STM32_ARG(RTC));
	}
#endif /* RTC_STM32_ALARMS_COUNT > 1 */
}

static inline void rtc_stm32_disable_interrupt_alarm(uint16_t id)
{
	if (id == RTC_STM32_ALRM_A) {
		LL_RTC_DisableIT_ALRA(STM32_ARG(RTC));
		return;
	}
#if RTC_STM32_ALARMS_COUNT > 1
	if (id == RTC_STM32_ALRM_B) {
		LL_RTC_DisableIT_ALRB(STM32_ARG(RTC));
	}
#endif /* RTC_STM32_ALARMS_COUNT > 1 */
}

static inline void rtc_stm32_enable_alarm(uint16_t id)
{
	if (id == RTC_STM32_ALRM_A) {
		LL_RTC_ALMA_Enable(STM32_ARG(RTC));
		return;
	}
#if RTC_STM32_ALARMS_COUNT > 1
	if (id == RTC_STM32_ALRM_B) {
		LL_RTC_ALMB_Enable(STM32_ARG(RTC));
	}
#endif /* RTC_STM32_ALARMS_COUNT > 1 */
}

static inline void rtc_stm32_disable_alarm(uint16_t id)
{
	if (id == RTC_STM32_ALRM_A) {
		LL_RTC_ALMA_Disable(STM32_ARG(RTC));
		return;
	}
#if RTC_STM32_ALARMS_COUNT > 1
	if (id == RTC_STM32_ALRM_B) {
		LL_RTC_ALMB_Disable(STM32_ARG(RTC));
	}
#endif /* RTC_STM32_ALARMS_COUNT > 1 */
}

void rtc_stm32_isr(const struct device *dev)
{
	struct rtc_stm32_data *data = dev->data;
	struct rtc_stm32_alrm *p_rtc_alrm;
	int id = 0;

	for (id = 0; id < RTC_STM32_ALARMS_COUNT; id++) {
		if (rtc_stm32_is_active_alarm((uint16_t)id) != 0) {
			stm32_backup_domain_enable_access();
			LL_RTC_DisableWriteProtection(STM32_ARG(RTC));
			rtc_stm32_clear_alarm_flag((uint16_t)id);
			LL_RTC_EnableWriteProtection(STM32_ARG(RTC));
			stm32_backup_domain_disable_access();

			if (id == RTC_STM32_ALRM_A) {
				p_rtc_alrm = &(data->rtc_alrm_a);
			} else {
				p_rtc_alrm = &(data->rtc_alrm_b);
			}

			p_rtc_alrm->is_pending = true;

			if (p_rtc_alrm->user_callback != NULL) {
				p_rtc_alrm->user_callback(dev, (uint16_t)id, p_rtc_alrm->user_data);
			}
		}
	}

	exti_clear_rtc_alarm_flag(RTC_STM32_EXTI_LINE_NUM);
}

static void rtc_stm32_irq_config(const struct device *dev)
{
	IRQ_CONNECT(DT_INST_IRQN(0),
		    DT_INST_IRQ(0, priority),
		    rtc_stm32_isr, DEVICE_DT_INST_GET(0), 0);
	irq_enable(DT_INST_IRQN(0));
}
#endif /* STM32_RTC_ALARM_ENABLED */

