zephyrproject-rtos/zephyr/drivers/rtc/rtc_stm32.c
static int rtc_stm32_init(const struct device *dev)
{
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	const struct rtc_stm32_config *cfg = dev->config;
	__maybe_unused struct rtc_stm32_data *data = dev->data;

	int err = 0;

	stm32_backup_domain_enable_access();

	/* Enable RTC bus clock */
	if (clock_control_on(clk, (clock_control_subsys_t)&cfg->pclken[0]) != 0) {
		stm32_backup_domain_disable_access();
		LOG_ERR("clock op failed\n");
		return -EIO;
	}

#if defined(CONFIG_SOC_SERIES_STM32WB0X)
	/**
	 * The STM32WB0 series has no bit for clock gating of RTC's APB
	 * interface. On the other hand, the RTCEN bit that would control
	 * whether the RTC IP is clock gated or not exists, and has been
	 * placed in APB0ENR. The call to clock_control_on() that just
	 * completed should have set this bit to 1.
	 *
	 * However, according to RefMan, the software must wait two slow
	 * clock cycles before the IP is actually usable, due to clock
	 * resynchronization delays. Sadly, there is no hardware register
	 * we can poll to wait until RTC is ready...
	 *
	 * In worst case scenario of 24 kHz LSI, we have to wait for:
	 *		tREADY = (2 cycles / 24'000 Hz) ≅ 84µs
	 *
	 * Spin until that much time has elapsed, and RTC should be up.
	 *
	 * N.B.: we can't use k_busy_wait because it uses the SysTick
	 * as time base, but SysTick is initialized after the RTC...
	 */
	const uint32_t cycles_to_waste =
		84 * (STM32_HCLK_FREQUENCY / USEC_PER_SEC);
	volatile uint32_t i = cycles_to_waste;

	while (--i > 0) {
		/* Do nothing - loop itself burns enough cycles */
	}
#endif /* CONFIG_SOC_SERIES_STM32WB0X */

#if DT_INST_CLOCKS_CELL_BY_IDX(0, 1, bus) == STM32_SRC_HSE
	/* Must be configured before selecting the RTC clock source */
	LL_RCC_SetRTC_HSEPrescaler(cfg->hse_prescaler);
#endif
	/* Enable RTC clock source */
	if (cfg->pclken[1].enr != NO_SEL) {
		err = clock_control_configure(clk, (clock_control_subsys_t)&cfg->pclken[1], NULL);

		if (err < 0) {
			stm32_backup_domain_disable_access();
			LOG_ERR("clock configure failed\n");
			return -EIO;
		}
	}

/*
 * On certain series, there is no bit in BCDR register to enable RTC;
 * a single bit in RCC controls both the RTC and bus interface. On
 * such series, the LL_RCC_EnableRTC function is usually not provided
 * by the STM32Cube package, but it's fine to skip calling it since
 * the RTC is already accessible thanks to clock_control_on() above.
 */
#if !defined(CONFIG_SOC_SERIES_STM32WBAX)
	z_stm32_hsem_lock(CFG_HW_RCC_SEMID, HSEM_LOCK_DEFAULT_RETRY);

	LL_RCC_EnableRTC();

	z_stm32_hsem_unlock(CFG_HW_RCC_SEMID);
#endif /* !CONFIG_SOC_SERIES_STM32WBAX */

	err = rtc_stm32_configure(dev);

	stm32_backup_domain_disable_access();

#ifdef STM32_RTC_ALARM_ENABLED
	rtc_stm32_irq_config(dev);

	exti_enable_rtc_alarm_it(RTC_STM32_EXTI_LINE_NUM);

	K_SPINLOCK(&data->lock) {
		memset(&(data->rtc_alrm_a), 0, sizeof(struct rtc_stm32_alrm));
		memset(&(data->rtc_alrm_b), 0, sizeof(struct rtc_stm32_alrm));
	}
#endif /* CONFIG_RTC_ALARM */

	return err;
}

static int rtc_stm32_set_time(const struct device *dev, const struct rtc_time *timeptr)
{
	struct rtc_stm32_data *data = dev->data;
	uint32_t real_year = timeptr->tm_year + TM_YEAR_REF;
	int err;

	if (real_year < RTC_YEAR_REF) {
		/* RTC does not support years before 2000 */
		return -EINVAL;
	}

	if (timeptr->tm_wday == -1) {
		/* day of the week is expected */
		return -EINVAL;
	}

	/* Enter Init mode inside the LL_RTC_Time and Date Init functions */
	uint32_t hours = bin2bcd(timeptr->tm_hour);
	uint32_t minutes = bin2bcd(timeptr->tm_min);
	uint32_t seconds = bin2bcd(timeptr->tm_sec);

	/* Set Date after Time to be sure the DR is correctly updated on stm32F2 series. */
	uint32_t year = bin2bcd((real_year - RTC_YEAR_REF));
	uint32_t month = bin2bcd((timeptr->tm_mon + 1));
	uint32_t day = bin2bcd(timeptr->tm_mday);
	uint32_t weekDay = ((timeptr->tm_wday == 0) ? (LL_RTC_WEEKDAY_SUNDAY) : (timeptr->tm_wday));
	/* WeekDay sunday (tm_wday = 0) is not represented by the same value in hardware,
	 * all the other values are consistent with what is expected by hardware.
	 */

	LOG_DBG("Setting clock");

	k_spinlock_key_t key = k_spin_lock(&data->lock);

	stm32_backup_domain_enable_access();

	/* Disable the write protection for RTC registers */
	LL_RTC_DisableWriteProtection(STM32_ARG(RTC));

	/* Set Initialization mode */
	err = rtc_stm32_enter_init_mode();

	if (err == 0) {
		/* Set time and date */
		LL_RTC_TIME_Config(STM32_ARG(RTC, STM32_RTC_LL_RTC_TIME_FORMAT_AM_OR_24,
					     hours, minutes, seconds));
		LL_RTC_DATE_Config(STM32_ARG(RTC, weekDay, day, month, year));
	}

	/* Exit Initialization mode */
	LL_RTC_DisableInitMode(STM32_ARG(RTC));

	/* Enable the write protection for RTC registers */
	LL_RTC_EnableWriteProtection(STM32_ARG(RTC));

	stm32_backup_domain_disable_access();

#ifdef CONFIG_SOC_SERIES_STM32F2X
	/*
	 * Because stm32F2 series has no shadow registers,
	 * wait until TR and DR registers are synchronised : flag RS
	 */
	while (LL_RTC_IsActiveFlag_RS(STM32_ARG(RTC)) != 1) {
		;
	}
#endif /* CONFIG_SOC_SERIES_STM32F2X */

	LOG_DBG("Calendar set : %d/%d/%d - %dh%dm%ds",
			LL_RTC_DATE_GetDay(STM32_ARG(RTC)),
			LL_RTC_DATE_GetMonth(STM32_ARG(RTC)),
			LL_RTC_DATE_GetYear(STM32_ARG(RTC)),
			LL_RTC_TIME_GetHour(STM32_ARG(RTC)),
			LL_RTC_TIME_GetMinute(STM32_ARG(RTC)),
			LL_RTC_TIME_GetSecond(STM32_ARG(RTC))
	);

	k_spin_unlock(&data->lock, key);

	return err;
}

static int rtc_stm32_get_time(const struct device *dev, struct rtc_time *timeptr)
{
	struct rtc_stm32_data *data = dev->data;

	uint32_t rtc_date, rtc_time;

#if HW_SUBSECOND_SUPPORT
	const struct rtc_stm32_config *cfg = dev->config;
	uint32_t rtc_subsecond;
#endif /* HW_SUBSECOND_SUPPORT */

	if (timeptr == NULL) {
		LOG_ERR("NULL rtc_time pointer");
		return -EINVAL;
	}

	k_spinlock_key_t key = k_spin_lock(&data->lock);

	if (!LL_RTC_IsActiveFlag_INITS(STM32_ARG(RTC))) {
		/* INITS flag is set when the calendar has been initialized. This flag is
		 * reset only on backup domain reset, so it can be read after a system
		 * reset to check if the calendar has been initialized.
		 */
		k_spin_unlock(&data->lock, key);
		return -ENODATA;
	}

	do {
		/* read date, time and subseconds and relaunch if a day increment occurred
		 * while doing so as it will result in an erroneous result otherwise
		 */
		rtc_date = LL_RTC_DATE_Get(STM32_ARG(RTC));
		do {
			/* read time and subseconds and relaunch if a second increment occurred
			 * while doing so as it will result in an erroneous result otherwise
			 */
			rtc_time = LL_RTC_TIME_Get(STM32_ARG(RTC));
#if HW_SUBSECOND_SUPPORT
			do {
				/* read subseconds and relaunch if a second increment occurred
				 * while doing so as it will result in an erroneous result otherwise
				 */
				rtc_subsecond = LL_RTC_TIME_GetSubSecond(STM32_ARG(RTC));
			} while (rtc_subsecond != LL_RTC_TIME_GetSubSecond(STM32_ARG(RTC)));
#endif /* HW_SUBSECOND_SUPPORT */
		} while (rtc_time != LL_RTC_TIME_Get(STM32_ARG(RTC)));
	} while (rtc_date != LL_RTC_DATE_Get(STM32_ARG(RTC)));

	k_spin_unlock(&data->lock, key);

	/* tm_year is the value since 1900 and Rtc year is from 2000 */
	timeptr->tm_year = bcd2bin(STM32_RTC_LL_GET_YEAR(rtc_date)) + (RTC_YEAR_REF - TM_YEAR_REF);
	/* tm_mon allowed values are 0-11 */
	timeptr->tm_mon = bcd2bin(STM32_RTC_LL_GET_MONTH(rtc_date)) - 1;
	timeptr->tm_mday = bcd2bin(STM32_RTC_LL_GET_DAY(rtc_date));

