zephyrproject-rtos/zephyr/drivers/rtc/rtc_stm32.c
	int hw_wday = STM32_RTC_LL_GET_WEEKDAY(rtc_date);

	if (hw_wday == LL_RTC_WEEKDAY_SUNDAY) {
		/* LL_RTC_WEEKDAY_SUNDAY = 7 but a 0 is expected in tm_wday for sunday */
		timeptr->tm_wday = 0;
	} else {
		/* all other values are consistent between hardware and rtc_time structure */
		timeptr->tm_wday = hw_wday;
	}

	timeptr->tm_hour = bcd2bin(STM32_RTC_LL_GET_HOUR(rtc_time));
	timeptr->tm_min = bcd2bin(STM32_RTC_LL_GET_MINUTE(rtc_time));
	timeptr->tm_sec = bcd2bin(STM32_RTC_LL_GET_SECOND(rtc_time));

#if HW_SUBSECOND_SUPPORT
	uint64_t temp = ((uint64_t)(cfg->sync_prescaler - rtc_subsecond)) * 1000000000L;

	timeptr->tm_nsec = temp / (cfg->sync_prescaler + 1);
#else
	timeptr->tm_nsec = 0;
#endif
	/* unknown values */
	timeptr->tm_yday  = -1;
	timeptr->tm_isdst = -1;

	/* __LL_RTC_GET_YEAR(rtc_date)is the real year (from 2000) */
	LOG_DBG("Calendar get : %d/%d/%d - %dh%dm%ds",
		timeptr->tm_mday,
		timeptr->tm_mon,
		STM32_RTC_LL_GET_YEAR(rtc_date),
		timeptr->tm_hour,
		timeptr->tm_min,
		timeptr->tm_sec);

	return 0;
}

#ifdef STM32_RTC_ALARM_ENABLED
static void rtc_stm32_alarm_get_alrm_time(uint16_t id, struct rtc_time *timeptr)
{
	if (id == RTC_STM32_ALRM_A) {
		timeptr->tm_sec = bcd2bin(LL_RTC_ALMA_GetSecond(STM32_ARG(RTC)));
		timeptr->tm_min = bcd2bin(LL_RTC_ALMA_GetMinute(STM32_ARG(RTC)));
		timeptr->tm_hour = bcd2bin(LL_RTC_ALMA_GetHour(STM32_ARG(RTC)));
		timeptr->tm_wday = bcd2bin(LL_RTC_ALMA_GetWeekDay(STM32_ARG(RTC)));
		timeptr->tm_mday = bcd2bin(LL_RTC_ALMA_GetDay(STM32_ARG(RTC)));
		return;
	}
#if RTC_STM32_ALARMS_COUNT > 1
	if (id == RTC_STM32_ALRM_B) {
		timeptr->tm_sec = bcd2bin(LL_RTC_ALMB_GetSecond(STM32_ARG(RTC)));
		timeptr->tm_min = bcd2bin(LL_RTC_ALMB_GetMinute(STM32_ARG(RTC)));
		timeptr->tm_hour = bcd2bin(LL_RTC_ALMB_GetHour(STM32_ARG(RTC)));
		timeptr->tm_wday = bcd2bin(LL_RTC_ALMB_GetWeekDay(STM32_ARG(RTC)));
		timeptr->tm_mday = bcd2bin(LL_RTC_ALMB_GetDay(STM32_ARG(RTC)));
	}
#endif /* RTC_STM32_ALARMS_COUNT > 1 */
}

static inline uint16_t rtc_stm32_alarm_get_alrm_mask(uint16_t id)
{
	uint32_t ll_alarm_mask = 0;
	uint16_t zephyr_alarm_mask = 0;
	uint32_t week_day = 0;

	/*
	 * STM32 RTC Alarm LL mask is set for all fields beyond the broadest one
	 * that's being matched with RTC calendar to trigger alarm periodically,
	 * the opposite of Zephyr RTC Alarm mask which is set for active fields.
	 */

	if (id == RTC_STM32_ALRM_A) {
		ll_alarm_mask = LL_RTC_ALMA_GetMask(STM32_ARG(RTC));
	}

#if RTC_STM32_ALARMS_COUNT > 1
	if (id == RTC_STM32_ALRM_B) {
		ll_alarm_mask = LL_RTC_ALMB_GetMask(STM32_ARG(RTC));
	}
#endif /* RTC_STM32_ALARMS_COUNT > 1 */

	if ((ll_alarm_mask & RTC_STM32_ALRM_MASK_SECONDS) == 0x0) {
		zephyr_alarm_mask = RTC_ALARM_TIME_MASK_SECOND;
	}
	if ((ll_alarm_mask & RTC_STM32_ALRM_MASK_MINUTES) == 0x0) {
		zephyr_alarm_mask |= RTC_ALARM_TIME_MASK_MINUTE;
	}
	if ((ll_alarm_mask & RTC_STM32_ALRM_MASK_HOURS) == 0x0) {
		zephyr_alarm_mask |= RTC_ALARM_TIME_MASK_HOUR;
	}
	if ((ll_alarm_mask & RTC_STM32_ALRM_MASK_DATEWEEKDAY) == 0x0) {
		if (id == RTC_STM32_ALRM_A) {
			week_day = LL_RTC_ALMA_GetWeekDay(STM32_ARG(RTC));
		}
#if RTC_STM32_ALARMS_COUNT > 1
		if (id == RTC_STM32_ALRM_B) {
			week_day = LL_RTC_ALMB_GetWeekDay(STM32_ARG(RTC));
		}
#endif /* RTC_STM32_ALARMS_COUNT > 1 */
		if (week_day) {
			zephyr_alarm_mask |= RTC_ALARM_TIME_MASK_WEEKDAY;
		} else {
			zephyr_alarm_mask |= RTC_ALARM_TIME_MASK_MONTHDAY;
		}
	}

	return zephyr_alarm_mask;
}

static int rtc_stm32_alarm_get_supported_fields(const struct device *dev, uint16_t id,
					uint16_t *mask)
{
	if (mask == NULL) {
		LOG_ERR("NULL mask pointer");
		return -EINVAL;
	}

	if ((id != RTC_STM32_ALRM_A) && (id != RTC_STM32_ALRM_B)) {
		LOG_ERR("invalid alarm ID %d", id);
		return -EINVAL;
	}

	*mask = (uint16_t)RTC_STM32_SUPPORTED_ALARM_FIELDS;

	return 0;
}

static int rtc_stm32_alarm_get_time(const struct device *dev, uint16_t id, uint16_t *mask,
			struct rtc_time *timeptr)
{
	struct rtc_stm32_data *data = dev->data;
	int err = 0;

	if ((mask == NULL) || (timeptr == NULL)) {
		LOG_ERR("NULL pointer");
		return -EINVAL;
	}

	k_spinlock_key_t key = k_spin_lock(&data->lock);

	if ((id != RTC_STM32_ALRM_A) &&
	    ((RTC_STM32_ALARMS_COUNT == 1) || (id != RTC_STM32_ALRM_B))) {
		LOG_ERR("invalid alarm ID %d", id);
		err = -EINVAL;
		goto unlock;
	}

	memset(timeptr, -1, sizeof(struct rtc_time));

	if (IS_ENABLED(CONFIG_SOC_SERIES_STM32H7RSX)) {
		stm32_backup_domain_enable_access();
	}

	rtc_stm32_alarm_get_alrm_time(id, timeptr);
	*mask = rtc_stm32_alarm_get_alrm_mask(id);

	if (IS_ENABLED(CONFIG_SOC_SERIES_STM32H7RSX)) {
		stm32_backup_domain_disable_access();
	}

	LOG_DBG("get alarm: mday = %d, wday = %d, hour = %d, min = %d, sec = %d, "
		"mask = 0x%04x", timeptr->tm_mday, timeptr->tm_wday, timeptr->tm_hour,
		timeptr->tm_min, timeptr->tm_sec, *mask);

unlock:
	k_spin_unlock(&data->lock, key);

	return err;
}

static int rtc_stm32_alarm_set_time(const struct device *dev, uint16_t id, uint16_t mask,
			const struct rtc_time *timeptr)
{
	struct rtc_stm32_data *data = dev->data;
	struct rtc_stm32_alrm *p_rtc_alrm;
	int err = 0;

	k_spinlock_key_t key = k_spin_lock(&data->lock);

	if (id == RTC_STM32_ALRM_A) {
		p_rtc_alrm = &(data->rtc_alrm_a);
	} else if (id == RTC_STM32_ALRM_B) {
		p_rtc_alrm = &(data->rtc_alrm_b);
	} else {
		LOG_ERR("invalid alarm ID %d", id);
		err = -EINVAL;
		goto unlock;
	}

	if ((mask == 0) && (timeptr == NULL)) {
		p_rtc_alrm->user_callback = NULL;
		p_rtc_alrm->user_data = NULL;
		p_rtc_alrm->is_pending = false;

		stm32_backup_domain_enable_access();

		LL_RTC_DisableWriteProtection(STM32_ARG(RTC));
		rtc_stm32_disable_alarm(id);
		rtc_stm32_disable_interrupt_alarm(id);
		LL_RTC_EnableWriteProtection(STM32_ARG(RTC));

		LOG_DBG("Alarm %d has been disabled", id);
		goto disable_bkup_access;
	}

	if ((mask & ~RTC_STM32_SUPPORTED_ALARM_FIELDS) != 0) {
		LOG_ERR("unsupported alarm %d field mask 0x%04x", id, mask);
		err = -EINVAL;
		goto unlock;
	}

	if ((mask & RTC_ALARM_TIME_MASK_WEEKDAY) && (mask & RTC_ALARM_TIME_MASK_MONTHDAY)) {
		/* STM32 RTC can match weekday OR monthday but not both at the same time */
		LOG_ERR("alarm %d cannot match weekday and monthday simultaneously", id);
		err = -EINVAL;
		goto unlock;
	}

	if (timeptr == NULL) {
		LOG_ERR("timeptr is invalid");
		err = -EINVAL;
		goto unlock;
	}

	if (!rtc_utils_validate_rtc_time(timeptr, mask)) {
		LOG_DBG("One or multiple time values are invalid");
		err = -EINVAL;
		goto unlock;
	}

	LOG_DBG("set alarm %d : second = %d, min = %d, hour = %d,"
			" wday = %d, mday = %d, mask = 0x%04x",
			id, timeptr->tm_sec, timeptr->tm_min, timeptr->tm_hour,
			timeptr->tm_wday, timeptr->tm_mday, mask);

	stm32_backup_domain_enable_access();

	/* Disable the write protection for RTC registers */
	LL_RTC_DisableWriteProtection(STM32_ARG(RTC));

	/* Disable ALARM so that the RTC_ISR_ALRAWF/RTC_ISR_ALRBWF is 0 */
	rtc_stm32_disable_alarm(id);
	rtc_stm32_disable_interrupt_alarm(id);

#ifdef RTC_ISR_ALRAWF
	if (id == RTC_STM32_ALRM_A) {
		/* Wait till RTC ALRAWF flag is set before writing to RTC registers */
		while (!LL_RTC_IsActiveFlag_ALRAW(STM32_ARG(RTC))) {
			;
		}
	}
#endif /* RTC_ISR_ALRAWF */

#ifdef RTC_ISR_ALRBWF
	if (id == RTC_STM32_ALRM_B) {
		/* Wait till RTC ALRBWF flag is set before writing to RTC registers */
		while (!LL_RTC_IsActiveFlag_ALRBW(STM32_ARG(RTC))) {
			;
		}
	}
#endif /* RTC_ISR_ALRBWF */

	/* init Alarm */
	rtc_stm32_init_alarm(timeptr, id, mask);

	/* Disable the write protection for RTC registers */
	LL_RTC_DisableWriteProtection(STM32_ARG(RTC));

	/* Enable Alarm */
	rtc_stm32_enable_alarm(id);
	/* Clear Alarm flag */
	rtc_stm32_clear_alarm_flag(id);
	/* Enable Alarm IT */
	rtc_stm32_enable_interrupt_alarm(id);

	exti_enable_rtc_alarm_it(RTC_STM32_EXTI_LINE_NUM);

	/* Enable the write protection for RTC registers */
	LL_RTC_EnableWriteProtection(STM32_ARG(RTC));

disable_bkup_access:
	stm32_backup_domain_disable_access();

unlock:
	k_spin_unlock(&data->lock, key);

	if (id == RTC_STM32_ALRM_A) {
		LOG_DBG("Alarm A : %dh%dm%ds   mask = 0x%x",
			LL_RTC_ALMA_GetHour(STM32_ARG(RTC)),
			LL_RTC_ALMA_GetMinute(STM32_ARG(RTC)),
			LL_RTC_ALMA_GetSecond(STM32_ARG(RTC)),
			LL_RTC_ALMA_GetMask(STM32_ARG(RTC)));
	}
#ifdef RTC_ALARM_B
	if (id == RTC_STM32_ALRM_B) {
		LOG_DBG("Alarm B : %dh%dm%ds   mask = 0x%x",
			LL_RTC_ALMB_GetHour(STM32_ARG(RTC)),
			LL_RTC_ALMB_GetMinute(STM32_ARG(RTC)),
			LL_RTC_ALMB_GetSecond(STM32_ARG(RTC)),
			LL_RTC_ALMB_GetMask(STM32_ARG(RTC)));
	}
#endif /* #ifdef RTC_ALARM_B */
	return err;
}

static int rtc_stm32_alarm_set_callback(const struct device *dev, uint16_t id,
			rtc_alarm_callback callback, void *user_data)
{
	struct rtc_stm32_data *data = dev->data;
	struct rtc_stm32_alrm *p_rtc_alrm;
	int err = 0;

	k_spinlock_key_t key = k_spin_lock(&data->lock);

	if (id == RTC_STM32_ALRM_A) {
		p_rtc_alrm = &(data->rtc_alrm_a);
	} else if (id == RTC_STM32_ALRM_B) {
		p_rtc_alrm = &(data->rtc_alrm_b);
	} else {
		LOG_ERR("invalid alarm ID %d", id);
		err = -EINVAL;
		goto unlock;
	}

	/* Passing the callback function and userdata filled by the user */
	p_rtc_alrm->user_callback = callback;
	p_rtc_alrm->user_data = user_data;

unlock:
	k_spin_unlock(&data->lock, key);

